Autodesk.Revit.DB.DirectContext3D.ClipPlane.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.ClipPlane.Normal
The plane's normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.ClipPlane.Origin
The plane's origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.ClipPlane.#ctor(Autodesk.Revit.DB.DirectContext3D.ClipPlane)
Constructs a copy of the clip plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.ClipPlane
A set of parameters representing a clip plane in DirectContext3D.
Since:
2017